// moovy-api/src/routes/qnaRoute.js

import { Router } from 'express'

const router = Router()

// ─────────────────────────────
// 1) QNA 작성
// ─────────────────────────────
router.post('/')

// ─────────────────────────────
// 2) 특정 QNA 가져오기
// ─────────────────────────────
router.get('/:qna_id')

// ─────────────────────────────
// 3) 내 QNA 리스트 가져오기
// ─────────────────────────────
router.get('/list')

// ─────────────────────────────
// 4) QNA 취소(삭제)
// ─────────────────────────────
router.delete('/')
